Cases/golfball2.3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inletWall
    {
        type            patch;
        nFaces          256;
        startFace       81522;
    }
    Wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          960;
        startFace       81778;
    }
    sym
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2843;
        startFace       82738;
    }
    outletWall
    {
        type            patch;
        nFaces          256;
        startFace       85581;
    }
    sphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1730;
        startFace       85837;
    }
)

// ************************************************************************* //
