Cases/golfball2.3/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletWall
    {
        type            zeroGradient;
    }

    outletWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    sym
    {
        type            symmetry;
    }

    "sphere*"
    {
        type            zeroGradient;
    }
    
    Wall
    {
    	type		zeroGradient;
    }

}

// ************************************************************************* //
