Cases/golfball2.3/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 350;

boundaryField
{
    inletWall
    {
        type            fixedValue;
        value           $internalField;
    }
    outletWall
    {
        type            zeroGradient;
    }
    "sphere*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    sym
    {
        type            symmetry;
    }
    Wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
   
}


// ************************************************************************* //
