Cases/golfball2.3/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletWall
    {
        type            calculated;
        value           uniform 0;
    }
    outletWall
    {
        type            calculated;
        value           uniform 0;
    }
    "sphere*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    sym
    {
        type            symmetry;
    }
    Wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
  
}


// ************************************************************************* //
